import React, { useEffect,useRef, useState } from 'react';
import "./Info.css";

export const Info = () => {

  const containerRef = useRef(null);
  const [isIntersecting,setIsIntersecting] = useState(false);

  useEffect(() =>{
    const observer = new IntersectionObserver((entry) =>{
      setIsIntersecting(entry.isIntersecting);
      const textInfo = document.getElementById("container-info");
      textInfo.style.marginTop = "10%";
      textInfo.style.opacity = "1";
    },{ rootMargin: "-300px" });
    observer.observe(containerRef.current);
      return () => observer.disconnect();
  },[isIntersecting]);

  return (
    <div className='container-info' id='container-info' ref={containerRef}>
        <div className="info1">
            <div className="info-title">المدارس الكرملية في لبنان</div>
            <br />
            <div className="info-content">آلاف الخريجين وقدامى طلاب مدارس الآباء الكرمليّين في لبنان حول العالم،
استقر رهبان الكرمل في طرابلس منذ عام 1645 واسسوا في قلب المدينة مدرسة في العام 1857 وهي مدرسة مار الياس للآباء الكرمليين والتي عرفت باسم مدرسة "الطليان". وبموازاة ازدهار مدينة طرابلس منتصف القرن الماضي، استقبلت "الطليان" تلامذتها من ابناء المناطق المجاورة: زغرتا، الكورة، جبة بشري، الضنية وعكار، وكذلك من البلدان العربية والخليجية. وازداد عدد الطلاب المقيمين في داخل المدرسة (المدرسة الداخلة)؛ وتميّزت مدرسة "الطليان" حينها بالنشاطات الرياضية، وريادتها لمختلف البطولات على صعيد لبنان والشمال.
ومنذ دخولهم الى القبيات سنة 1836 اسسوا مدرسة في القبيات، عرفت بمدرسة تحت السنديانة في البداية، ومن ثم بنوا بمحاذات الديرمدرسة صغيرة وهي مدرسة مارضوميط للآباء الكرمليين واليوم أصبحت صرحاً ضخماً ساهم في تربية غالبية أبناء المنطقة العكارية.
في اواخر الخمسينيات قام الرهبان ببناء مدرسة ثالثة في بيروت في الحازمية على اسم سيدة الكرمل إلا أنها تحولت في أواخر التسعينات الى ادارة علمانية.
وفي سنة 1971 قرر الآباء بناء مدرسة جديدة تستوعب الأعداد المتزايدة من الطلاب في منطقة مجدليا التي تربط طرابلس والضنية وزغرتا، وبنوها مدرسةً حديثة جداً، واسمها "الكرملية". كانت تحتوي قاعات كبيرة وملاعب متعددة، محاطة بغابات من الصنوبر والشربين، إلا انها دمرت بالكامل سنة 1976 بسبب الحرب. إلا ان الرهبان أصروا على اعادة بنائها واستمروا في رسالتهم التعليمية ونشر المعرفة والإنفتاح والمحبة بين الجميع.
مع مطلع 2010 تم الاتفاق على توحيد اسماء المدارس والتي باتت تعرف جميعها باسم</div>
        </div>
        <div className="info2">
            <div className="info-big-title">"مدارس الكرملية"</div>
            <div className="info-content"><span>:رسالة الأب ريمون عبدو الرئيس الاقليمي لرهبان الكرمل في لبنان لطلاب مدارس الكرملية</span>
لقد غلبنا الجهل وانتصرنا، وعبرنا الحرب ومن تحت الركام صعدنا... وكنت أنت، أيها الطالب الحبيب، في قلب تلك السنوات المتتالية، تنمو وتكبر لكي تصل الى حيث أنت.
اليوم نعود الى الذكريات لأن في قلوبنا شوق، ليس الى الماضي، بل الى قلوبٍ أحبت وتحب من أجل بناء الإنسان والوطن.
مدارس الكرمليّة في طرابلس، القبيات، الحازمية ومجدليا، هي بانتظار أن نعيد سوية بناء ما تمكنت منه الحرب والأيام الصعبة. سوية يمكننا أن نعيد كتابة سطور في حياة الوطن والإنسان.</div>
        </div>
        <div className="writer-info">
        Père Raymond Abdo <span> - Founder’s Carmelite Alumni </span>
        </div>
    </div>
  )
}

export default Info;
